# Створіть словник, зв'язавши його з змінною school, і наповніть його даними, які б відображали кількість учнів в десяти різних класах (наприклад, 1а, 1б, 2б, 6а, 7в тощо.).
# Дізнайтеся скільки людей в певному класі. Уявіть, що в школі відбулися зміни, додайте їх в словник:
# - В трьох класах змінилося кількість учнів;
# - В школі з'явилося два нових класу;
# - В школі розформували один з класів.
# Виведіть вміст словника на екран.


school = {'1a':20, '1b':21, '2a':15, '2b':33, '3a':23, '3b':31, '4a':25, '4b':32, '5a':26, '5b':18, '6a':30, '6b':19, '7a':28, '7b':17, '8a':27, '8b':24, '9a':22, '9b':29, '10a':16, '10b':35}
print (school)
print (school['2a'])

school['1b'] -= 2
school['2b'] -= 1
school['3b'] -=3

print (school)
del school['4b']
print (school)

school['10b']=35
print (school)
