# Відомий РІК. Визначити, чи буде цей рік високосним, і до якого століття цей рік відноситься

y = int(input())
if y % 4 != 0 or (y % 100 == 0 and y % 400 != 0):
    print("Обычный")
else:
    print("Високосный")



# Залежно від вибору користувача, обчислити площу або прямокутника, або трикутника, або круга. Якщо обрані прямокутник або трикутник, то треба запросити довжини сторін; круга – його радіус.

a = int(input("оберіть площу чого будемо обчислювати: 1 - прямокутник, 2 - трикутник, 3 - круг"))
if a == 1:
    a = int(input('Сторона a: '))
    b = int(input('Сторона b: '))
    S = a * b
print('Площадь = ', S,)





# Користувач вводить число, програма повинна вивести на екран його опис. Наприклад, «додатне однозначне число», «від’ємне двозначне» тощо.

a = int(input("Введіть число: "))
if a > 0 and a < 10:
    print ("Число положительное, однозначное")
if a > 0 and a > 10 and a <100:  
    print ("Число положительное, двухзначное")
if a < 0 and a > -10:
    print ("Число отрицательное, однозначное")
if a < 0 and a < -10 and a > -100:
    print ("Число отрицательное, двухзначное")	 



# Чи можна в квадратному залі площею S помістити круглу сцену радіусом R так, щоб від стіни до сцени був прохід не менше K?

import math
S = int(input("Введите площадь зала: "))
R = int(input("Введите радиус сцены: "))
K = int(input("Какой проход в метрах нужно оставить?: "))
result = (math.sqrt(S)) - (R*2)
if result < K:
  print ("В таком зале такую сцену разместить не сможем")
else:
  print ("Все ок, такую сцену сможем разместить и останется нужный нам проход")



# Відома грошова сума. Розміняти її купюрами 200, 100, 10 і монетою 1 грн., якщо це можливо

