# У програмі генерується випадкове ціле число від 0 до 100. Користувач повинен його відгадати не більше ніж за 10 спроб. Після кожної невдалої спроби повинно повідомлятися чи більше чи менше введене користувачем число, ніж те, що загадане. Якщо за 10 спроб число не відгадане, то вивести загадане число.
 
import random
a = int(input("Введите число:")
number = random.randint(0, 100)
raz = 0
while raz != 10:
  if a == b:
    print ("Поздравляю, Вы угадали число!")
    break
  if a<b:
    print ("Ваше число меньше задуманного")
    raz +=1
    continue
  if a>b:
    print ("Ваше число больше задуманного")
    raz +=1
    continue
print ("10 попыток вышло. Задуманное число: " + b)





# Вводяться десять натуральних чисел більше 2. Порахувати, скільки серед них чисел, що кратні 5-ти.






# Вивести на екран таблицю множення (від 1 до 9).

for i in range(1,10):
    for p in range(1,10):
        print("%4d" % (i*p), end='')
    print()




# Вивести на екран «прямокутник», утворений з двох видів символів. Контур прямокутника повинен складатися з одного символу, а "заливка" - з іншого.


for i in range(10):
    if i==0 or i==9:
        for j in range(20):
            print('h',end='')
    else:
        print('h',end='')
        for j in range(1,19):
            print('l',end='')
        print('h',end='')
    print()



# Дано число P  і число H. Користувач вводить послідовність чисел. Визначити: суму тих чисел, які менше P; добуток чисел, які більші за H; кількість чисел, що знаходяться  в діапазоні значень від P до H. При введенні числа рівного P або H, припинити обчислення та вивести результат.






# Для чисел, що вводяться користувачем, визначити відсоток додатних та від’ємних чисел. При введенні числа 0 закінчити роботу.





